<a href="https://colab.research.google.com/github/MaximTislenko/GB_med_stat_R/blob/main/%D0%A1%D0%BE%D0%B7%D0%B4_%D0%BD%D0%B0%D0%B1%D0%BE%D1%80%D0%B0_03.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Создание набора данных

In [3]:
library(tidyverse)
library(readxl)

── Attaching core tidyverse packages ──────────────────────── tidyverse 2.0.0 ──
✔ dplyr     1.1.4     ✔ readr     2.1.5
✔ forcats   1.0.0     ✔ stringr   1.5.1
✔ ggplot2   3.4.4     ✔ tibble    3.2.1
✔ lubridate 1.9.3     ✔ tidyr     1.3.1
✔ purrr     1.0.2
── Conflicts ────────────────────────────────────────── tidyverse_conflicts() ──
✖ purrr::%||%()   masks base::%||%()
✖ dplyr::filter() masks stats::filter()
✖ dplyr::lag()    masks stats::lag()
ℹ Use the conflicted package (<http://conflicted.r-lib.org/>) to force all conflicts to become errors

# Основы управления данными

In [4]:
leadership <- data.frame(
  manager = c(1, 2, 3, 4, 5),
  date = c("10/24/08", "10/28/08", "10/1/08", "10/12/08", "5/1/09"),
  country = c("US", "US", "UK", "UK", "UK"),
  gender = c("M", "F", "F", "M", "F"),
  age = c(32, 45, 25, 39, 99),
  q1 = c(5, 3, 3, 3, 2),
  q2 = c(4, 5, 5, 3, 2),
  q3 = c(5, 2, 5, 4, 1),
  q4 = c(5, 5, 5, NA, 2),
  q5 = c(5, 5, 2, NA, 1)
  )

leadership

  manager date     country gender age q1 q2 q3 q4 q5
1 1       10/24/08 US      M      32  5  4  5   5  5
2 2       10/28/08 US      F      45  3  5  2   5  5
3 3       10/1/08  UK      F      25  3  5  5   5  2
4 4       10/12/08 UK      M      39  3  3  4  NA NA
5 5       5/1/09   UK      F      99  2  2  1   2  1

## Создание новых переменных

Чаще всего используется операция присваивания:

переменная <- выражение

* $+$ -  Сложение
* $-$ - Вычитание
* $*$ - Умножение
* $/$ - Деление
* ^ или $**$ - Возведение в степень
* x%%y -  Деление по модулю (остаток от деления) x на y: 5%%2=1
* x%/%y -  Деление нацело x на y: 5%/%2=2

In [5]:
# первый способ
leadership$total_score <- leadership$q1 + leadership$q2 + leadership$q3 + leadership$q4 + leadership$q5
leadership$mean_score <- (leadership$q1 + leadership$q2 + leadership$q3 + leadership$q4 + leadership$q5)/5
leadership

  manager date     country gender age q1 q2 q3 q4 q5 total_score mean_score
1 1       10/24/08 US      M      32  5  4  5   5  5 24          4.8
2 2       10/28/08 US      F      45  3  5  2   5  5 20          4.0
3 3       10/1/08  UK      F      25  3  5  5   5  2 20          4.0
4 4       10/12/08 UK      M      39  3  3  4  NA NA NA           NA
5 5       5/1/09   UK      F      99  2  2  1   2  1  8          1.6

In [6]:
# второй способ
leadership <- transform(leadership,
total_score = q1 + q2 + q3 + q4 + q5,
mean_score = (q1 + q2 + q3 + q4 + q5)/5)
leadership

  manager date     country gender age q1 q2 q3 q4 q5 total_score mean_score
1 1       10/24/08 US      M      32  5  4  5   5  5 24          4.8
2 2       10/28/08 US      F      45  3  5  2   5  5 20          4.0
3 3       10/1/08  UK      F      25  3  5  5   5  2 20          4.0
4 4       10/12/08 UK      M      39  3  3  4  NA NA NA           NA
5 5       5/1/09   UK      F      99  2  2  1   2  1  8          1.6

## Перекодирование переменных
Логические переменные:
* $<$ - Меньше, чем
* $<=$ - Меньше или равно
* $>$ - Больше, чем
* $>=$ - Больше или равно
* $==$ - Точно равно
* $!=$ - Не равно
* $!x$ - Инверсия x (НЕ x)
* $x | y$ - x ИЛИ y
* x&y - x И y
* $isTRUE(x)$ -Проверяет истинность значения x

Задачи:
* преобразовать непрерывные данные в категориальные;
* заменить ошибочные данные правильными значениями;
* создать переменную типа «сдал / не сдал» на основе экзаменационных баллов.

In [7]:
leadership$age[leadership$age == 99] <- NA
leadership

  manager date     country gender age q1 q2 q3 q4 q5 total_score mean_score
1 1       10/24/08 US      M      32  5  4  5   5  5 24          4.8
2 2       10/28/08 US      F      45  3  5  2   5  5 20          4.0
3 3       10/1/08  UK      F      25  3  5  5   5  2 20          4.0
4 4       10/12/08 UK      M      39  3  3  4  NA NA NA           NA
5 5       5/1/09   UK      F      NA  2  2  1   2  1  8          1.6

In [8]:
#  используется функция within, она похожа на with, но позволяет модифицировать таблицу
leadership <- within(leadership,{
  agecat <- NA
  agecat[age > 75] <- "Elder"
  agecat[age >= 55 & age <= 75] <- "Middle Aged"
  agecat[age < 55] <- "Young"
  })
leadership
# дополнительные функции перекодирования recode() - в пакете car, recodeVar() - в пакете doBy, cut() - R

  manager date     country gender age q1 q2 q3 q4 q5 total_score mean_score
1 1       10/24/08 US      M      32  5  4  5   5  5 24          4.8
2 2       10/28/08 US      F      45  3  5  2   5  5 20          4.0
3 3       10/1/08  UK      F      25  3  5  5   5  2 20          4.0
4 4       10/12/08 UK      M      39  3  3  4  NA NA NA           NA
5 5       5/1/09   UK      F      NA  2  2  1   2  1  8          1.6
  agecat
1 Young
2 Young
3 Young
4 Young
5 NA

## Переименование переменных (столбцов)

$fix(leadership)$ - откроет интерактивный редактор

или

$names(leadership)[2] <- "testDate"$

In [9]:
names(leadership)
names(leadership)[2] <- "testDate"
leadership

 [1] "manager"     "date"        "country"     "gender"      "age"
 [6] "q1"          "q2"          "q3"          "q4"          "q5"
[11] "total_score" "mean_score"  "agecat"

  manager testDate country gender age q1 q2 q3 q4 q5 total_score mean_score
1 1       10/24/08 US      M      32  5  4  5   5  5 24          4.8
2 2       10/28/08 US      F      45  3  5  2   5  5 20          4.0
3 3       10/1/08  UK      F      25  3  5  5   5  2 20          4.0
4 4       10/12/08 UK      M      39  3  3  4  NA NA NA           NA
5 5       5/1/09   UK      F      NA  2  2  1   2  1  8          1.6
  agecat
1 Young
2 Young
3 Young
4 Young
5 NA

In [10]:
names(leadership)[6:10] <- c("item1", "item2", "item3", "item4", "item5")
leadership

  manager testDate country gender age item1 item2 item3 item4 item5 total_score
1 1       10/24/08 US      M      32  5     4     5      5     5    24
2 2       10/28/08 US      F      45  3     5     2      5     5    20
3 3       10/1/08  UK      F      25  3     5     5      5     2    20
4 4       10/12/08 UK      M      39  3     3     4     NA    NA    NA
5 5       5/1/09   UK      F      NA  2     2     1      2     1     8
  mean_score agecat
1 4.8        Young
2 4.0        Young
3 4.0        Young
4  NA        Young
5 1.6        NA

## Пропущенные значения

Функция $is.na()$:

\>y <- c(1, 2, 3, NA)

\>is.na(y)

Результат:

c(FALSE, FALSE, FALSE, TRUE)

Функция $is.infinite()$ - положительная и отрицательная бесконечности

In [11]:
is.na(leadership[,6:10])

     item1 item2 item3 item4 item5
[1,] FALSE FALSE FALSE FALSE FALSE
[2,] FALSE FALSE FALSE FALSE FALSE
[3,] FALSE FALSE FALSE FALSE FALSE
[4,] FALSE FALSE FALSE  TRUE  TRUE
[5,] FALSE FALSE FALSE FALSE FALSE

In [12]:
is.na(leadership[,])

     manager testDate country gender age   item1 item2 item3 item4 item5
[1,] FALSE   FALSE    FALSE   FALSE  FALSE FALSE FALSE FALSE FALSE FALSE
[2,] FALSE   FALSE    FALSE   FALSE  FALSE FALSE FALSE FALSE FALSE FALSE
[3,] FALSE   FALSE    FALSE   FALSE  FALSE FALSE FALSE FALSE FALSE FALSE
[4,] FALSE   FALSE    FALSE   FALSE  FALSE FALSE FALSE FALSE  TRUE  TRUE
[5,] FALSE   FALSE    FALSE   FALSE   TRUE FALSE FALSE FALSE FALSE FALSE
     total_score mean_score agecat
[1,] FALSE       FALSE      FALSE
[2,] FALSE       FALSE      FALSE
[3,] FALSE       FALSE      FALSE
[4,]  TRUE        TRUE      FALSE
[5,] FALSE       FALSE       TRUE

### Перекодирование значений в отсутствующие

```
leadership\$age[leadership\$age == 99] <- NA
```

### Исключение пропущенных значений из анализа

```
x <- c(1, 2, NA, 3)
y <- x[1] + x[2] + x[3] + x[4]
z <- sum(x)
```
Функция `na.omit()` - построчное удаление если есть пропущенные значения.

In [13]:
x <- c(1, 2, NA, 3)
y <- x[1] + x[2] + x[3] + x[4]
z <- sum(x)
z
y
x

[1] NA

[1] NA

[1]  1  2 NA  3

In [14]:
y <- sum (x, na.rm = TRUE)
y

[1] 6

In [15]:
leadership
newdata <- na.omit (leadership)
newdata

  manager testDate country gender age item1 item2 item3 item4 item5 total_score
1 1       10/24/08 US      M      32  5     4     5      5     5    24
2 2       10/28/08 US      F      45  3     5     2      5     5    20
3 3       10/1/08  UK      F      25  3     5     5      5     2    20
4 4       10/12/08 UK      M      39  3     3     4     NA    NA    NA
5 5       5/1/09   UK      F      NA  2     2     1      2     1     8
  mean_score agecat
1 4.8        Young
2 4.0        Young
3 4.0        Young
4  NA        Young
5 1.6        NA

  manager testDate country gender age item1 item2 item3 item4 item5 total_score
1 1       10/24/08 US      M      32  5     4     5     5     5     24
2 2       10/28/08 US      F      45  3     5     2     5     5     20
3 3       10/1/08  UK      F      25  3     5     5     5     2     20
  mean_score agecat
1 4.8        Young
2 4.0        Young
3 4.0        Young

## Календарные даты

В R даты обычно вводятся в виде текстовых строк, а затем преобразуются в формат даты и хранятся в числовом виде. Для этого преобразования используется функция `as.Date()`, имеющая следующий синтаксис:

`as.Date(x, "input_format")`

где x – это дата в текстовом формате, а input_format определяет
формат представления даты:
* %d - День месяца в виде числа (01–31)
* %a - Сокращенное название дня недели
* %A - Полное название дня недели
* %m - Порядковый номер месяца (01–12)
* %b - Сокращенное название месяца
* %B - Полное название месяца
* %y - Две последние цифры года
* %Y - Все четыре цифры года

Функция `Sys.Date()` возвращает текущую дату, а функция `date()` – текущие дату и время.

Для вывода дат в заданном формате и извлечения отдельных компонентов можно использовать функцию `format(x, format="output_ format")`

In [16]:
# По умолчанию даты вводятся в формате yyyy-mm-dd («год-месяц-день»)
mydates <- as.Date(c("2007-06-22", "2004-02-13")) # преобразует текстовые данные в даты, используя этот формат по умолчанию.
mydates

[1] "2007-06-22" "2004-02-13"

In [17]:
# В отличие от нее, следующая инструкция:
strDates <- c("01/05/1965", "08/16/1975")
dates <- as.Date(strDates, "%m/%d/%Y") # читает даты в формате mm/dd/yyyy («месяц/день/год»).
dates

[1] "1965-01-05" "1975-08-16"

In [18]:
leadership

  manager testDate country gender age item1 item2 item3 item4 item5 total_score
1 1       10/24/08 US      M      32  5     4     5      5     5    24
2 2       10/28/08 US      F      45  3     5     2      5     5    20
3 3       10/1/08  UK      F      25  3     5     5      5     2    20
4 4       10/12/08 UK      M      39  3     3     4     NA    NA    NA
5 5       5/1/09   UK      F      NA  2     2     1      2     1     8
  mean_score agecat
1 4.8        Young
2 4.0        Young
3 4.0        Young
4  NA        Young
5 1.6        NA

In [19]:
# В нашем наборе данных leadership даты представлены в формате mm/dd/yy. Поэтому в инструкциях
myformat <- "%m/%d/%y"
leadership$testDate <- as.Date(leadership$testDate, myformat) # используется нестандартный формат, позволяющий прочитать текстовую
                                                      # переменную и преобразовать ее в столбец, содержащий календарные даты.
leadership

  manager testDate   country gender age item1 item2 item3 item4 item5
1 1       2008-10-24 US      M      32  5     4     5      5     5
2 2       2008-10-28 US      F      45  3     5     2      5     5
3 3       2008-10-01 UK      F      25  3     5     5      5     2
4 4       2008-10-12 UK      M      39  3     3     4     NA    NA
5 5       2009-05-01 UK      F      NA  2     2     1      2     1
  total_score mean_score agecat
1 24          4.8        Young
2 20          4.0        Young
3 20          4.0        Young
4 NA           NA        Young
5  8          1.6        NA

In [20]:
Sys.Date()
date()

[1] "2024-06-04"

[1] "Tue Jun  4 13:51:26 2024"

In [21]:
today <- Sys.Date()
format(today, format="%B %d %Y")
format(today, format="%A")

[1] "June 04 2024"

[1] "Tuesday"

In [22]:
# С датами можно производить арефметические действия
startdate <- as.Date("2020-02-13")
enddate <- as.Date("2021-01-22")
days <- enddate - startdate
days

Time difference of 344 days

In [23]:
today <- Sys.Date()
dob <- as.Date("1956-10-12")
difftime(today, dob, units="weeks")

Time difference of 3529.571 weeks

# Преобразование дат в текстовые переменные
Также есть возможность преобразовать данные в формате даты и времени в текстовые значения, хотя это бывает нужно не так часто. Это можно сделать при помощи функции `as.character()`:

`strDates <- as.character(dates)`

Это позволяет применять к датам многие текстовые функции (разделение на подгруппы, замена, конкатенация и т. д.).

### Дополнительно
Чтобы узнать больше о преобразовании текстовых переменных в даты, загляните в справку `help(as.Date)` и `help(strftime)`. Также дополнительную информацию о форматах даты и времени можно найти в `help(ISOdatetime)`. Пакет lubridate содержит множество функций, упрощающих работу с датами, в том числе функции, обнаруживающие данные в формате даты и времени и извлекающие отдельные составляющие таких данных (например, годы, месяцы, дни и т. д.), а также выполняющие арифметические операции с ними. Если вам нужно произвести сложные вычисления с датами, воспользуйтесь пакетом fCalendar. В нем содержится несметное число функций для работы с датами. Эти функции позволяют одновременно работать с несколькими часовыми поясами и совершать сложные операции с календарем, распознавая рабочие, выходные и праздничные дни.

## Преобразование данных из одного типа в другой
Функции:
* `is.тип_данных()` - возвращают TRUE или FALSE,
* `as.тип_данных()` - преобразуют данные в соответствующий формат.


---
* is.numeric() ----------- as.numeric()
* is.character() --------- as.character()
* is.vector() -------------- as.vector()
* is.matrix() -------------- as.matrix()
* is.data.frame() ------- as.data.frame()
* is.factor() --------------- as.factor()
* is.logical() -------------- as.logical()

# Ввод данных с клавиатуры
1.Создается пустая таблица или матрица
2.Открывается текстовый редактор (функция $edit()$)

In [ ]:
mydata <- data.frame(age=numeric(0), gender=character(0), weight=numeric())
mydata
# mydata <- edit(mydata)

     age gender weight

In [ ]:
# fix(mydata)

In [ ]:
mydatatxt <- "
age gender weight
25 m 166
30 f 115
18 f 120
"
mydata <- read.table(header = TRUE, text = mydatatxt)
mydata

  age gender weight
1 25  m      166
2 30  f      115
3 18  f      120

# Импорт данных из текстового файла с разделителями

$mydataframe <- read.table(file, options)$

, где $file$ - текстовый файл ASCII, с разделителями,

$options$ - список параметров:

* $header$ - Логическое значение, указывающее содержит ли файл имена переменных в первой строке;
* $sep$ - Определяет разделитель между ячейками.

 По умолчанию: $sep="пробел"$.

 Для импорта из CSV -> $sep="пробел"$

 Для импорта из TSV -> $sep="\t"$
* $row.names$ - Необязательный параметр, определяющий одну или несколько переменных, представляющих идентефикаторы строк.
* $col.names$ - Если первая строка в файле не содержит имен переменных ($header=FALSE$), то можно передать параметр $col.names$ определяющий текстовый вектор с именами переменных. Есл $header=FALSE$ и параметр $col.names$ не задан, то переменные получат имена V1, V2 и т.д.
* $na.strings$ - Необязательный текстовый вектор, определяющий значения, которые должны интерпретироваться как отсутствующие значения. Например, $na.strings=c("9", "?")$ преобразует все значения 9 и ? в $NA$.
* $colClasses$ - Необязательный вектор классов, назначаемых столбцам. Например, передать параметр $colClasses = C("numeric", "numeric", "character", "NULL", "numeric")$ то функция $read.table()$ прочитает первые два столбца как числовые, третий столбец как текстовый, пропустит четвертый столбец и прочитает пятый столбец как числовой. Если данных больше пяти столбцов, то параметр $colClasses$ будет использован повторно
* $quote$ - Символ(ы), используемый(е) для ограничения строк, содержащих специальные символы. Обычно в этом параметре передается двойная (") или одинарная (') кавычка
* $skip$ - Количество строк в файле, которые нужно пропустить перед началом чтения (коментарии к файлу)
* $stringAsFactors$ - Логическое значение, указывающее на необходимость преобразования текстовых переменных в факторы. При импорте больших текстовых файлов $stringAsFactors = FALSE$ может значительно ускорить обработку.
* $text$ - Текстовая строка для импорта. Если передан парамер $text$, то параметр $file$ можно опустить

In [ ]:
grades <- read.table("/content/studentgrades.csv", header=TRUE, row.names = "StudentID", sep = ",")
grades
str(grades)

Warning message in read.table("/content/studentgrades.csv", header = TRUE, row.names = "StudentID", :
“incomplete final line found by readTableHeader on '/content/studentgrades.csv'”

   First Last          Math Science Social.Studies
11 Bob   Smith         90   80      67
12 Jane  Weary         75   NA      80
10 Dan   Thornton, III 65   75      70
40 Mary  O'Leary       90   95      92

'data.frame':	4 obs. of  5 variables:
 $ First         : chr  "Bob" "Jane" "Dan" "Mary"
 $ Last          : chr  "Smith" "Weary" "Thornton, III" "O'Leary"
 $ Math          : int  90 75 65 90
 $ Science       : int  80 NA 75 95
 $ Social.Studies: int  67 80 70 92

In [ ]:
# Импортируем те же данные, указав класс для каждой переменной
gades <- read.table("/content/studentgrades.csv",
 header = TRUE, row.names = "StudentID", sep = ",",
 colClasses = c("character", "character", "character", "numeric", "numeric", "numeric") )
gades
str(gades)

Warning message in read.table("/content/studentgrades.csv", header = TRUE, row.names = "StudentID", :
“incomplete final line found by readTableHeader on '/content/studentgrades.csv'”

    First Last          Math Science Social.Studies
011 Bob   Smith         90   80      67
012 Jane  Weary         75   NA      80
010 Dan   Thornton, III 65   75      70
040 Mary  O'Leary       90   95      92

'data.frame':	4 obs. of  5 variables:
 $ First         : chr  "Bob" "Jane" "Dan" "Mary"
 $ Last          : chr  "Smith" "Weary" "Thornton, III" "O'Leary"
 $ Math          : num  90 75 65 90
 $ Science       : num  80 NA 75 95
 $ Social.Studies: num  67 80 70 92

# Импорт данных через соединения

Вместо имени файла можно использовать функции:
* $file()$
* $gzfile()$
* $bzfile()$
* $xzfile()$
* $unz()$
* $url()$

Подробности $help(file)$

# Дополнительные функции чтения данных

Это функции "обертки", которые вызывают $read.table()$ со своими параметрами

* $read.csv()$ - $header = TRUE$ и $sep = ","$
* $read.delim()$ - $header = TRUE$ и $sep = "\t"$

In [ ]:
grades <- read.csv("/content/studentgrades.csv")
grades

Warning message in read.table(file = file, header = header, sep = sep, quote = quote, :
“incomplete final line found by readTableHeader on '/content/studentgrades.csv'”

  StudentID First Last          Math Science Social.Studies
1 11        Bob   Smith         90   80      67
2 12        Jane  Weary         75   NA      80
3 10        Dan   Thornton, III 65   75      70
4 40        Mary  O'Leary       90   95      92

# Импорт данных из Excel

Лучший способ импортировать файл в формате Excel – предварительно сохранить его в формате текстового файла с разделителями
и только потом импортировать, как описано выше. Также файлы
Excel можно импортировать с помощью пакета $readxl$.

Пакет $readxl$ можно использовать для чтения файлов Excel
в форматах $.xls$ и $.xlsx$. Функция $read\_excel()$ импортирует рабо-
чий лист в таблицу данных в виде усовершенствованной таблицы
tibble. Самый простой вариант вызова – $read\_excel(file, n)$, где $file$ определяет путь к книге Excel, а $n$ – номер импортируемой таблицы, в которой первая строка содержит имена переменных. Например:
$$library(readxl)$$
$$workbook <- "c:/myworkbook.xlsx"$$
$$mydataframe <- read\_xlsx(workbook, 1)$$
импортирует первый лист из книги $myworkbook.xlsx$, хранящейся на
диске C:, и сохранит его в виде таблицы данных mydataframe.
Функция $read\_excel()$ принимает параметры, позволяющие задать определенный диапазон ячеек (например, $range = "Mysheet!B2:G14"$) вместе с классом каждого столбца ($col\_types$).
Подробности ищите в $help(read\_excel)$.
В числе других пакетов, которые могут помочь в работе с фай-
лами Excel, можно назвать: $xlsx$, $XLConnect$ и $openxlsx$. Пакеты $xlsx$ и $XLConnect$ требуют наличия установленной среды выполнения
Java на компьютере, а $openxlsx$ – нет. В отличие от $readxl$, эти па-
кеты могут не только импортировать листы, но также создавать
файлы Excel и управлять ими. Программистам, разрабатывающим
интерфейс между R и Excel, следует внимательно изучить один или
несколько из этих пакетов.

In [ ]:
library(readxl)
workbook <- "c:/myworkbook.xlsx"
mydataframe <- read_xlsx(workbook,1)

# Импорт данных из JSON-файлов

В последнее время все чаще данные распространяются в виде файлов в формате JSON (JavaScript Object Notation – форма записи
объектов JavaScript). В R есть несколько пакетов для работы с такими файлами. Например, пакет jsonlite позволяет читать, писать
и преобразовывать объекты JSON. Данные в формате JSON можно
импортировать непосредственно в таблицы данных R. Обсуждение этого формата выходит за рамки нашей книги. Заинтересованным в работе с JSON-файлами я рекомендую обратиться к прекрасной справочной документации с описанием пакета jsonlite на сайте https://cran.r-project.org/web/packages/jsonlite/.

# Извлечение данных из веб страниц

Данные из интернета можно получить методом веб-скраппинга (web-scrapping) или с использованием прикладных программных интерфейсов (Application Programming Interfaces, API). Вебскраппинг обычно используется для извлечения информации, находящейся внутри веб-страниц, тогда как API позволяют взаимодействовать с веб-службами и удаленными хранилищами данных.

При извлечении данных из интернета методом веб-скраппинга пользователи обычно сохраняют их в виде объектов R для дальнейшего анализа. Например, при помощи функции readLines() можно извлечь текст из веб-страницы и дальше работать с ним, используя функции $grep()$ и $gsub()$.

Пакет rvest предлагает функции, упрощающие извлечение данных из веб-страниц. Он был создан по образу и подобию библиотеки Beautiful Soup для Python. Для извлечения информации из сложно устроенных веб-страниц можно также использовать пакеты RCurl и XML. Более полную информацию, включая примеры, можно найти в руководстве «Examples of Web Scraping with R» на сайте ProgrammingR (http://www.programmingr.com/).

Прикладные интерфейсы API определяют порядок взаимодействий программных компонентов друг с другом. В R имеется несколько пакетов, использующих такой подход для извлечения данных из веб-ресурсов, служащих источниками данных по биологии, медицине, науках о Земле, физических науках, экономике, финансах, литературе, маркетингу и т. д.

Например, интересующиеся социальными сетями могут получить доступ к данным в Twitter через twitteR, в Facebook через Rfacebook и в Flickr через Rflickr. Также есть пакеты для доступа к популярным веб-службам Google, Amazon, Dropbox, Salesforce и др. Полный список пакетов для доступа к веб-ресурсам вы найдете в статье «CRAN Task View: Web Technologies and Services» (http://mng.bz/370r).

# Импорт данных из SPSS

Наборы данных в формате IBM SPSS можно импортировать в R при помощи функции $read_spss()$ из пакета haven. Сначала нужно скачать и установить пакет:

$install.packages("haven")$


и затем выполнить следующий код:

$library(haven)$

$mydataframe <- read\_spss("mydata.sav")$

Набор данных будет импортирован в усовершенствованную таблицу данных (tibble), а переменным, содержащим метки импортированных значений SPSS, будет назначен класс labelled. Эти переменные класса labelled можно преобразовать в факторы, используя следующий код:

$labelled_vars <- names(mydataframe)[sapply(mydataframe, is.labelled)]$

$for (vars in labelled\_vars)${

$mydataframe[[vars]] = as\_factor(mydataframe[[vars]])$

}

Пакет haven имеет ряд дополнительных функций для чтения
файлов SPSS в сжатом ($.zsav$) или транспортном ($.por$) формате.

# Импорт данных из SAS

Наборы данных SAS можно импортировать с помощью функции $read_sas()$ из пакета haven. После установки пакета данные можно импортировать, как показано ниже:

$library(haven)$

$mydataframe <- read\_sas("mydata.sas7bdat")$

Если у вас есть и каталог форматов переменных, их также можно импортировать и применять к данным, например:

$mydataframe <- read\_sas("mydata.sas7bdat",$

$catalog\_file = "mydata.sas7bcat")$

В любом случае результатом будет усовершенствованная таблица
данных tibble.
Имеется также коммерческий продукт Stat/Transfer (описанный в разделе 2.3.10), отлично справляющийся с импортом наборов данных из SAS (включая любые существующие форматы переменных) в виде таблиц данных R.

# Импорт данных из Stata

Импортировать данные из Stata в R очень просто:

$library(haven)$

$mydataframe <- read\_dta("mydata.dta")$

Здесь $mydata.dta$ – это набор данных Stata, а mydataframe – это итоговая таблица данных R в формате усовершенствованной таблицы
tibble.

# Импорт из баз данных

R может взаимодействовать с самыми разными базами данных,включая Microsoft SQL Server, Microsoft Access, MySQL, Oracle, PostgreSQL,
DB2, Sybase, Teradata и SQLite. Некоторые пакеты предоставляют доступ через оригинальные драйверы баз данных, тогда как другие обеспечивают доступ к данным через ODBC (Open Database Connectivity interface – открытый интерфейс взаимодействия с базами данных) или JDBC (Java Database Connectivity interface – Java-интерфейс взаимодействия с базами данных). Поддержка в R доступа к данным, хранящимся во внешних базах данных, позволяет эффективно обрабатывать большие наборы данных (см. приложение F), используя мощные возможности обоих языков, SQL и R.

## Интерфейс ODBC

Самый, пожалуй, популярный способ доступа к базам данных в R – с использованием пакета RODBC, позволяющий подключиться к любой базе данных, для которой имеется драйвер ODBC. К таким базам данных относятся все перечисленные выше.

Первый шаг – установка и настройка драйвера ODBC для конкретной операционной системы и базы данных, поскольку они не являются частью R. Если нужные драйверы у вас еще не установлены, их можно найти в интернете (хорошей отправной точкой может стать статья «Setting up ODBC Drivers», доступная по адресу: https://db.rstudio.com/best-practices/drivers/).

После установки и настройки драйверов установите пакет RODBC, выполнив инструкцию install.packages("RODBC").

Основные функции, предлагаемые этим пакетом, перечислены ниже:
* $odbcConnect(dsn, uid="", pwd="")$ - Открывает соединение с базой данных ODBC.
* $sqlFetch(channel, sqltable)$ - Читает таблицу из базы данных ODBC в таблицу данных в R.
* $sqlQuery(channel,query)$ - Посылает запрос в базу данных ODBC и возвращает результаты.
* $sqlSave(channel, mydf, tablename = sqltable, append=FALSE)$ - Сохраняет или обновляет (append=TRUE) таблицу данных в виде таблицы в базе данных ODBC.
* $sqlDrop(channel, sqltable)$ - Удаляет таблицу из базы данных ODBC.
* $close(channel)$ - Закрывает соединение.

Пакет RODBC устанавливает двустороннее соединение между R и базой данных SQL, что позволяет не только загружать данные в R, но и изменять содержимое базы данных из программы на R. Представьте, что вам нужно импортировать две таблицы (Crime – преступление и Punishment – наказание) из БД в таблицы данных R с именами $crimedat$ и $pundat$ соответственно. Это можно сделать так:

$library(RODBC)$

$myconn <-odbcConnect("mydsn", uid="Rob", pwd="aardvark")$

$crimedat <- sqlFetch(myconn, Crime)$

$pundat <- sqlQuery(myconn, "select * from Punishment")$

&close(myconn)$

Этот код загружает пакет RODBC и открывает соединение с базой данных ODBC через зарегистрированное имя источника данных (mydsn) с дентификатором пользователя UID (rob) и паролем (aardvark). Объект соединения передается в функцию sqlFetch, которая импортирует содержимое таблицы Crime в таблицу данных crimedat. Затем выполняется SQL-запрос select, извлекающий данные из таблицы Punishment, и эти данные сохраняются в таблице данных pundat. В заключение соединение закрывается.

Функция $sqlQuery()$ открывает массу возможностей, позволяя выполнить любой действительный SQL-запрос. Эта гибкость дает возможность извлекать отдельные переменные и подмножества данных, создавать новые переменные, а также перекодировать и переименовывать существующие переменные.

## Пакеты, связанные с DBI

Пакет DBI – универсальный и последовательный пользовательский интерфейс для доступа к базам данных. Созданный на его основе фреймворк RJDBC позволяет получить доступ к БД через драйвер JDBC. Не забудьте перед его использованием установить драйверы JDBC для соответствующей операционной системы и базы данных. В числе других полезных пакетов, основанных на DBI, можно назвать: RMySQL, ROracle, RPostgreSQL и RSQLite. Эти пакеты содержат также оригинальные драйверы для конкретных баз данных, однако они могут работать не во всех операционных системах. Ознакомьтесь с документацией на CRAN (http://cran.r-project.org), чтобы узнать подробности.

# Импорт данных при помощи Stat/Transfer

Прежде чем закончить обсуждение импорта данных, стоит упомянуть коммерческий продукт, способный значительно упростить импорт данных.Stat/Transfer (https://www.stattransfer.com/) – это самостоятельная программа, которая может преобразовывать данные в любой из 34 форматов, включая R.

# Аннотирование наборов данных

Исследователи обычно аннотируют свои наборы данных, чтобы упростить интерпретацию результатов. Аннотирование, как правило, заключается в добавлении поясняющих подписей (меток) к именам переменных и кодам данных, используемым в категориальных переменных. Например, переменную age можно снабдить пояснительной подписью "Age at hospitalization (in years)" («Возраст в момент госпитализации (в годах)»). А коды значений 1 и 2 для переменной gender – подписями "male" (мужской) и "female"
(женский).

## Подписи для переменных

К сожалению, R имеет довольно ограниченные возможности для работы с подписями для переменных. Один из подходов: оформить подпись в виде имени переменной, а в операциях ссылаться на нее по ее индексу. Вернемся к предыдущему примеру с данными о пациентах. Во втором столбце, age, хранится возраст пациентов, в котором они попали в больницу. Инструкция

$names(patientdata)[2] <- "Age at hospitalization (in years)"$

переименует age в "Age at hospitalization (in years)". Конечно, это новое название слишком длинное, чтобы писать его в программах по многу раз. Вместо этого на переменную можно ссылаться как patientdata[2], при этом в выводе будет отображаться ее полное имя "Age at hospitalization (in years)". Конечно, это не идеальное решение, и, возможно, разумнее остановиться на более простом имени (например, admissionAge).

## Подписи для значений переменных

Функция $factor()$ позволяет добавлять подписи к значениям категориальных переменных. Продолжим наш пример и предположим, что у нас есть переменная gender, в которой значение «мужской пол» закодировано как 1, а «женский пол» – как 2. Подписи к значениям этой переменной можно создать так:

$patientdata$gender <- factor(patientdata$gender,$

$levels = c(1,2),$

$labels = c("male", "female"))$

Здесь параметр $levels$ определяет фактические значения перемен-
ной, а $labels$ – текстовый вектор с соответствующими подписями.